component_keys_ru_to_en = {
    "Производительность": {
    "en_key": "performance",
    "ru_keys": [
        "Двигатель", "Мотор", "Мощность", "движок", "Двигатель внутреннего сгорания", "ДВС", "Электродвигатель", "Электромотор",
        "Двигатель автомобиля", "Моторный блок", "Силовой агрегат", "Генератор", "Двигательная установка", "Механизм привода",
        "Механизм перемещения", "Турбина", "Турбомотор", "Бензиновый двигатель", "Дизельный двигатель", "Газовый двигатель",
        "Мотор-генератор", "Блок цилиндров", "Картер двигателя", "Силовая установка", "Блок мотора", "Мотор внутреннего сгорания",
        "Двигатель с турбонаддувом", "Двигатель с компрессором", "Двигатель с наддувом", "Блок мотора", "Двигатель с воздушным охлаждением",
        "Двигатель с жидкостным охлаждением", "Головка блока цилиндров", "Поршневой механизм", "Распределительный вал", "Трамблер",
        "Турбокомпрессор", "Коленчатый вал", "Клапан", "Поршень", "Цилиндр двигателя", "Механизм газораспределения", "Моторчик",
        "Механизм вращения", "Коллектор", "Моторная установка", "Энергетическая установка", "Энергоустановка", "Энергетический агрегат",
        "Механизм подъема", "Потоковый двигатель", "Носовой двигатель", "Двигатель электромагнитный", "Механизм регулировки мощности",
        "Генератор мощности", "Двигатель с приводом", "Насос", "Компрессор", "Турбомотор", "Трансмиссионный двигатель", "Механизм обогрева",
        "Двигатель многоступенчатый", "Двигатель с регулируемой мощностью", "Двигатель с изменяемым КПД", "Мощный мотор", "Топливный насос",
        "Двигатель с рециркуляцией", "Реактивный двигатель", "Мотор с подачей топлива", "Бензомотор", "Поршневой мотор", "Тепловой двигатель",
        "Гибридный двигатель", "Энергетический механизм", "Коаксиальный двигатель", "Двигатель с плазменным управлением",
        "Силовая установка на газе", "Двигатель с мотором для генератора", "Мотор от электровоза", "Мотор от поезда", "Интеркулер",
        "Двигатель с управляющим клапаном", "Термодвигатель", "Мотор с изменяемым валом", "Энергетический мотор", "Двигатель с воздушным охлаждением",
        "Двигатель с водяным охлаждением", "Электрогенератор", "Интермотор", "Легковой мотор", "Реактивный мотор", "Двигатель с предсмешиванием",
        "Двигатель с циклом Стирлинга", "Мотор с распредвалом", "Двигатель с функцией регенерации", "Двигатель с улучшенной производительностью",
        "Мотор с прямым впрыском", "Двигатель с непосредственным впрыском", "Мотор с дистанционным управлением", "Двигатель с генератором",
        "Новый тип двигателя", "Мотор с турбо-насосом", "Двигатель с экологическим фильтром", "Силовая установка с высокой мощностью",
        "Генератор электроэнергии", "Двигатель для водного транспорта", "Электрический мотор", "Промышленный двигатель", "Турбодвигатель",
        "Двигатель с изменяемым крутящим моментом", "Суперкомпактный мотор", "Автомобильный двигатель", "Гибридный мотор", "Электродвигатель с высокой мощностью",
        "Силовой агрегат с высоким КПД", "Двигатель с переменной геометрией", "Мощный мотор для спортивных автомобилей", "Легкий двигатель",
        "Генератор с переменным током", "Турбокомпрессор с межтопливным охлаждением", "Двигатель для тяжелых условий эксплуатации", "Двигатель с системой охлаждения",
        "Мотор с инжектором", "Двигатель с механической трансмиссией", "Двигатель с электронным управлением", "Мотор с системой управления впрыском",
        "Высокоэффективный мотор", "Двигатель с непосредственным впрыском топлива", "Силовой агрегат для электрических автомобилей", "Двигатель для гибридных автомобилей"
        ]
    },

    "Комфорт и управляемость": {
    "en_key": "comfort_handling",
    "ru_keys": [
        "Комфорт", "Подвеска", "Шумоизоляция", "Рулежка", "Управляемость", "Удобство", "Мягкость хода", "Амортизаторы", "Пружины",
        "Подвеска автомобиля", "Рулевое управление", "Рулевое колесо", "Качество дороги", "Уровень шума", "Тишина в салоне", "Уровень вибрации",
        "Обивка салона", "Акустическая система", "Подогрев сидений", "Кондиционер", "Климат-контроль", "Массаж сидений", "Эргономичность сидений",
        "Системы безопасности", "Технологии помощи водителю", "Автопилот", "Автоматическое управление", "Системы контроля полосы", "Система контроля усталости",
        "Регулировка сидений", "Рулевое управление с электрическим усилителем", "Пневмоподвеска", "Трехступенчатая амортизация", "Мягкая подвеска",
        "Гидравлические амортизаторы", "Блокировка дифференциала", "Интерьер с шумоизоляцией", "Подогрев руля", "Круиз-контроль", "Регулировка угла наклона сиденья",
        "Руль с регулируемым усилием", "Панорамный люк", "Комфортные сиденья", "Охлаждение сидений", "Комфортное расстояние между сиденьем и рулем",
        "Бесключевой доступ", "Система мониторинга слепых зон", "Камера заднего вида", "Парктроники", "Режим комфорта", "Интерьер с мягким покрытием",
        "Режим экономии топлива", "Подвеска с электронным управлением", "Системы активного торможения", "Адаптивный круиз-контроль", "Подогрев стекол",
        "Автономный климат-контроль", "Дистанционное управление климатом", "Интерьер с подогревом", "Активная безопасность", "Мобильные технологии",
        "Проекционный дисплей", "Звуковая изоляция", "Электрическое рулевое управление", "Электрические стеклоподъемники", "Подвеска с регулируемой жесткостью",
        "Автоматическое регулирование высоты кузова", "Механизм регулировки жесткости сидений", "Технологии повышения комфорта", "Багажное отделение с подогревом",
        "Динамическое управление устойчивостью", "Рулевое управление с изменяемым усилием", "Система подавления шума", "Низкий уровень вибрации", "Система помощи при парковке",
        "Элементы декора салона", "Качество отделки", "Подвеска с автоматическим регулированием", "Технологии улучшения дорожной устойчивости"
        ]
    },

    "Надежность и качество": {
    "en_key": "reliability_quality",
    "ru_keys": [
        "Надежность", "Качество", "Сборка", "Материалы", "Долговечность", "Прочность", "Износостойкость", "Качество деталей", "Безопасность",
        "Гарантия", "Технология производства", "Обслуживаемость", "Качество материалов", "Конструкция", "Устойчивость к износу", "Тестирование",
        "Проверка на прочность", "Водонепроницаемость", "Коррозийная стойкость", "Испытания на нагрузку", "Прочные компоненты", "Ремонтопригодность",
        "Устойчивость к температурным колебаниям", "Качество сборки", "Низкий коэффициент износа", "Ремонтоспособность", "Срок службы", "Защита от влаги",
        "Тесты на длительный срок", "Надежность в экстремальных условиях", "Использование высококачественных материалов", "Проверка комплектующих",
        "Износостойкость кузова", "Антикоррозийная обработка", "Технологии защиты от износа", "Безопасность эксплуатации", "Качество работы механизма",
        "Надежность системы", "Стойкость к внешним воздействиям", "Долговечность деталей", "Надежность при высоких нагрузках", "Контроль качества",
        "Система качества", "Качество сборки автомобилей", "Поддержка гарантии", "Прочность кузова", "Безопасность конструкции", "Контроль на всех этапах",
        "Снижение износа", "Система повышения надежности", "Проверка на долговечность", "Энергетическая эффективность", "Технология обработки деталей",
        "Качество покрытий", "Система обеспечения качества", "Ресурс автомобиля", "Поддержка на всех этапах эксплуатации", "Надежность на всем протяжении эксплуатации"
        ]
    },

    "Внешний вид": {
    "en_key": "exterior_design",
    "ru_keys": [
        "Дизайн", "Внешний вид", "Экстерьер", "Вид", "Кузов", "Кузов автомобиля", "Автомобильный стиль", "Форма", "Аэродинамика", "Краш-тест",
        "Краска", "Цвет автомобиля", "Линия кузова", "Отделка", "Стиль", "Комплектация кузова", "Тип кузова", "Передний бампер", "Задний бампер",
        "Крыло", "Двери", "Стекла", "Фары", "Зеркала", "Линия крыши", "Передняя решетка", "Капот", "Молдинги", "Наружные элементы", "Багажник",
        "Наружные панели", "Новые линии", "Штамповка кузова", "Отделка салона", "Форма стекол", "Элементы кузова", "Декор", "Обвес", "Тонировка",
        "Шины", "Диски", "Рамка кузова", "Краш-система", "Задняя часть автомобиля", "Передняя часть автомобиля", "Панели кузова", "Автомобильные формы",
        "Молдинги и накладки", "Внешний стиль", "Обвесы", "Тюнинг", "Капот с вентиляцией", "Решетка радиатора", "Накладки на кузов", "Покраска кузова",
        "Элементы внешнего оформления", "Крышка багажника", "Спойлер", "Широкие арки", "Передние фары", "Задние фары", "Диффузор", "Сетчатая решетка",
        "Трехмерный дизайн", "Противотуманные фары", "Электрическая система", "Решетки вентиляции", "Обвес с аэродинамическим эффектом", "Задний спойлер",
        "Светодиодные фары", "Ксеноновые фары", "Тюнинг-фары", "Автохроматика", "Кузов с противоударной защитой", "Эстетика автомобиля", "Матовые элементы",
        "Накладки для кузова", "Визуальные элементы", "Каркас кузова", "Элементы аэродинамики", "Подвеска с наружным видом", "Кроссоверный стиль",
        "Элементы отделки кузова", "Индивидуальный стиль", "Новые формы кузова", "Фасад автомобиля", "Ультрасовременный дизайн", "Автомобиль в стиле ретро",
        "Элементы отделки колес", "Элементы кузовных деталей", "Автомобильный экстерьер", "Гладкие линии", "Решетка радиатора с хромированным покрытием",
        "Светодиодная подсветка", "Покраска с эффектом перламутра", "Цветовое решение", "Симметрия кузова", "Технология окраски", "Молдинги и шильдики"
        ]
    },

    "Интерьер": {
    "en_key": "interior",
    "ru_keys": [
        "Интерьер", "Салон", "Отделка салона", "Эргономика", "Удобство салона", "Декор салона", "Материалы отделки", "Качество отделки",
        "Цвет салона", "Обивка сидений", "Обивка дверей", "Вентиляция", "Кондиционер", "Массаж сидений", "Подогрев сидений", "Кресла", "Сиденья",
        "Панель приборов", "Руль", "Рулевое колесо", "Руль с подогревом", "Кресло водителя", "Эргономичные сиденья", "Регулировка сидений",
        "Режим сиденья", "Материалы сидений", "Элементы регулировки сиденья", "Обивка кресел", "Регулировка положения сиденья", "Шумоизоляция салона",
        "Шумопоглощение", "Гармония в интерьере", "Декор", "Элементы отделки", "Комфортное пространство", "Комфорт сидений", "Пробковое покрытие",
        "Кожаная отделка", "Салон с кожаной отделкой", "Тканевая обивка", "Пластиковые элементы", "Качество материалов", "Автопроводка", "Обогрев сидений",
        "Гармония цветовых решений", "Шарнир сидений", "Регулировка спинки сиденья", "Микроклимат в салоне", "Автопилот", "Система очистки воздуха",
        "Обивка потолка", "Коврики салона", "Панель управления", "Перфорированная кожа", "Матовый пластик", "Интерьер с подсветкой", "Натуральная кожа",
        "Полировка панели", "Стильный интерьер", "Мягкие материалы", "Потолочная обивка", "Микроволновая текстура", "Качество ковров", "Технологии комфорта",
        "Потрясающий интерьер", "Ткань с эффектом гламура", "Освежитель воздуха", "Элементы отделки в стиле минимализм", "Элементы яркого дизайна",
        "Удобство размещения в салоне", "Климат-контроль", "Камера ночного видения", "Мультимедийная система", "Подставки для напитков", "Перчаточный ящик",
        "Полиуретановая отделка", "Светодиодная подсветка", "Интерьер с возможностью настроек", "Перфорированные сиденья", "Многофункциональное сиденье",
        "Мультимедиа и удобства", "Регулировка наклона сиденья", "Элементы велюрового покрытия", "Спортивные сиденья", "Гармония материала", "Интерьер для путешествий",
        "Ремни безопасности", "Задний подлокотник", "Крышка багажника", "Элементы потолка", "Нижняя панель дверей", "Автозапуск кондиционера"
        ]
    },

    "Экономичность и стоимость": {
    "en_key": "economy_price",
    "ru_keys": [
        "Цена", "Экономичность", "Расход топлива", "Стоимость", "Обслуживание", "Запчасти", "Стоимость обслуживания", "Обслуживание автомобиля",
        "План обслуживания", "Долговечность", "Цена за ремонт", "Топливо", "Стоимость владения", "Энергопотребление", "Снижение расхода топлива",
        "Расход на километраж", "Экономичный автомобиль", "Расход топлива на 100 км", "Цена автомобиля", "Топливная эффективность", "Гибридное топливо",
        "Эффективность двигателя", "Налог на автомобиль", "Техническое обслуживание", "Механизмы экономии топлива", "Ремонт автомобиля", "Уровень расхода топлива",
        "Качество топлива", "Автомобиль с низким расходом топлива", "Покупка автомобиля", "Расход на топливо", "Цена на бензин", "Стоимость страховки",
        "Стоимость ТО", "Система рекуперации энергии", "Технические расходы", "Система экономии энергии", "Налоги на транспорт", "Стоимость ремонта двигателя",
        "Обслуживание коробки передач", "Эффективная экономия", "Технические средства экономии", "Поддержка стоимости", "Уменьшение затрат на эксплуатацию",
        "Электрическая система экономии", "Стоимость замены расходников", "Стоимость гарантии", "Экономичные расходные материалы", "Поддержка по гарантии",
        "Ремонт системы охлаждения", "Цена за литр топлива", "Стоимость аккумулятора", "Снижение потребления энергии", "Цены на автозапчасти",
        "Обслуживание трансмиссии", "Низкий расход топлива", "Автомобиль с низкой стоимостью эксплуатации", "Стоимость шин", "Замена деталей", "Сумма налога",
        "Энергетический расход", "Бензиновая эффективность", "Электрический расход", "Гибридные технологии", "Цена за замену аккумулятора", "Экономичное движение",
        "Система экономичного вождения", "Цена за обслуживание кондиционера", "Технические осмотры", "Стоимость страховки для автомобиля"
        ]
    },

    "Вместимость": {
    "en_key": "capacity",
    "ru_keys": [
        "Багажник", "Вместимость", "Размер багажника", "Пространство", "Место", "Объем багажника", "Сиденья", "Места для пассажиров",
        "Объем салона", "Перевозка грузов", "Грузоподъемность", "Складные сиденья", "Дополнительное пространство", "Объем для хранения", "Грузовой отсек",
        "Размеры салона", "Вместительность", "Элементы трансформации сидений", "Места для багажа", "Трансформация сидений", "Гибкая планировка",
        "Пространство для вещей", "Места для пассажиров и багажа", "Отделение для хранения", "Грузовое отделение", "Габариты багажного отсека",
        "Пространственная эффективность", "Отделение для инструментов", "Грузовой объем", "Трансформируемое пространство", "Складной багажник",
        "Вмещаемость", "Места для размещения вещей", "Багажное отделение", "Пассажирские сиденья", "Элементы хранения", "Компактный багажник",
        "Места для перевозки", "Складная система сидений", "Дополнительная вместимость", "Ремни для багажа", "Максимальная вместимость",
        "Элементы складного багажника", "Вместимость салона", "Площадь багажного отсека", "Отсек для чемоданов", "Мест для багажа",
        "Размеры багажного отделения", "Низкая вместимость", "Гибкая вместимость"
        ]
    },

    "Внедорожные качества": {
    "en_key": "offroad",
    "ru_keys": [
        "Клиренс", "Полный привод", "Проходимость", "Quattro", "quattro", "кватро", "кватровая", "4WD", "Полный привод на всех колесах", "Кроссовер", "Высокий клиренс", "Проходимость по бездорожью",
        "Низкий центр тяжести", "Подготовка для внедорожья", "Трансмиссия 4x4", "Трансмиссия с пониженной передачей", "Автоматический полный привод",
        "Подвеска с высоким ходом", "Система контроля спуска с горы", "Механизм блокировки дифференциала", "Шины для внедорожья", "Мощный двигатель",
        "Проходимость в грязи", "Проходимость на песке", "Проходимость на снегу", "Низкий угловой клиренс", "Внедорожные шины", "Пневмоподвеска для внедорожья",
        "Угол подъема", "Угол спуска", "Защита от камней", "Система стабилизации при сплошном движении", "Повышенная проходимость", "Система тяги",
        "Проходимость по камням", "Шины для грязевых дорог", "Обогрев зеркал", "Система антибуксования", "Система блокировки колес", "Автоматическая блокировка дифференциала",
        "Полный привод на все колеса", "Пневмоподвеска", "Внедорожные амортизаторы", "Элементы защиты от воды", "Топливный бак для внедорожья", "Роботизированная коробка передач",
        "Система контролируемого спуска", "Дифференциал с блокировкой", "Автономные системы для бездорожья", "Проходимость на каменистых дорогах",
        "Двигатель с высокой мощностью для внедорожья", "Высокая проходимость при сплошных участках", "Проходимость в условиях пересеченной местности", "Интеллектуальная система полного привода",
        "Высокая проходимость на холмах", "Мощный турбированный двигатель", "Внедорожные характеристики", "Технологии для преодоления препятствий", "Подготовка для езды по снегу",
        "Комплектация для внедорожных поездок", "Двигатель с высоким крутящим моментом", "Легкие элементы для внедорожья", "Амортизаторы с регулировкой жесткости",
        "Технические характеристики для внедорожного использования", "Подготовка для экстренной езды", "Обогрев для экстремальных условий", "Усиленная подвеска для внедорожья",
        "Блокировка переднего и заднего дифференциала", "Шины с высоким сцеплением", "Модификация для внедорожья", "Прочные подвески", "Жесткость подвески для бездорожья",
        "Дифференциал с повышенным крутящим моментом", "Подготовка для езды по скользким дорогам", "Высокая устойчивость на сложных трассах", "Система интеграции для внедорожья",
        "Увеличенный дорожный просвет", "Противопесочные шины", "Защита днища", "Интеллектуальные системы внедорожных характеристик", "Проходимость на водных маршрутах",
        "Подготовка к сложным погодным условиям"
        ]
    },

    "Оснащение": {
    "en_key": "equipment",
    "ru_keys": [
        "Оснащение", "Опции", "Комплектация", "Технологии", "Электроника", "Дополнительное оборудование", "Кондиционер", "Система климат-контроля", "Сенсорный экран",
        "Система безопасности", "Аудиосистема", "Мультимедиа", "Автозапуск", "Система GPS", "Парктроники", "Камера заднего вида", "Круиз-контроль",
        "Автоматическая коробка передач", "Бортовой компьютер", "Проекционный дисплей", "Адаптивный круиз-контроль", "Система предупреждения столкновений", "Подогрев сидений",
        "Электрические стеклоподъемники", "Задние датчики парковки", "Система управления мультимедиа", "Система контроля давления в шинах", "Блокировка дверей",
        "Электрический люк", "Ксеноновые фары", "Светодиодные фары", "Автоматические фары", "Передние и задние датчики", "Управление через смартфон", "Беспроводная зарядка",
        "Система помощи при парковке", "Система помощи при старте в гору", "Система регулировки жесткости подвески", "Система контроля полосы", "Датчики дождя",
        "Вентиляция сидений", "Система помощи при экстренном торможении", "Универсальные адаптеры", "Подключение через Bluetooth", "Система дистанционного управления",
        "Камера кругового обзора", "Аудиосистема премиум класса", "Система контроля слепых зон", "Панорамный люк", "Электрическое сиденье", "Зеркала с подогревом",
        "Система легкого доступа", "Трехзонный климат-контроль", "Регулировка сидений по высоте", "Система защиты от перегрева", "Память сидений", "Электрические зеркала",
        "Камера для наблюдения за дорожной ситуацией", "Передняя камера", "Автономный климат-контроль", "Автоматическое закрытие дверей", "Цифровая панель приборов",
        "Система предупреждения об опасности", "Система управления тягой", "Поддержка голосовых команд", "Модуль связи", "Система контроля скорости", "Задняя камера",
        "Панель управления на руле", "Тепловое зеркало", "Автоматический выбор режима", "Интерьерный светодиодный свет", "Система управления колесами",
        "Управление фарой дальнего света", "Электрическое регулирование рулевого колеса", "Система регулировки руля", "Подогрев зеркал", "Режим ночного видения",
        "Блокировка заднего дифференциала", "Интеграция с мобильным приложением", "Автономный обогреватель", "Турбо-ускорение", "Дополнительные пороги",
        "Роботизированная коробка передач", "Подключение через Wi-Fi", "Обогрев рулевого колеса", "Блокировка заднего дифференциала", "Поддержка систем управления движением",
        "Гибридная силовая установка", "Интерфейс с мультимедийной системой", "Система автоматического торможения", "Регулировка колеса", "Шумоизоляция салона",
        "Ремень безопасности с датчиком удара", "Система активного торможения", "Модуль подключения через интернет", "Блокировка безопасности", "Пассажирские кресла с подогревом"
        ]
    },

    #TODO добавить еще синонимов + мб словарей
}